// / Напишите функцию, которая принимает два числовых аргумента a и b (a > b), и выводит 
// в консоль числа от a до b кратные 3.
// Пример 10, 3 => 9, 6, 3

// const getNum = (a, b) => {
//   for (let i = a; i >= b; i--){
//     if(i % 3 === 0){
//     console.log(i)
//     }
//   }
// }
// getNum(10,1);


// Напишите функцию, которая суммирует числа от 0 до 100 кратные 3 или 5. Выведите сумму в консоль.

// const getSum = () => {
//   let sum = 0
//   for (let i = 0; i <= 100; i++){
//     if(i % 3 === 0 || i % 5 === 0){
//       sum += i // sum = sum + 1
//     }
//   }
//   return sum
// }
// console.log(getSum());


//Напишите функцию, формирующую массив из чисел от 0 до 50 кратных 5.
// => [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

// const getArr = () => {
//   let result = [];
//   for (let i = 0; i <= 50; i++){
//     if (i % 5 === 0 && i !== 0){
//       result.push(i)             // чтобы сложить массив надо пушен
//     }            
//   }
//   return result
// }
// console.log(getArr());


// Напишите функцию, формирующую массив из чисел от a до b (b > a) кратных 2.

// const getArr1 = (a, b) => {
//   let result = [];
//   for (let i=a; i<= b; i++){
//     if (i%2 ===0){
//       arr.pish(i);
//     }
//   }
//   return arr
// }
// console.log(getArr1(5,30));







