// 1. Напишите цикл for, который выводит числа в консоль от 100 до 130.
// for (let i = 100; i <= 130; i++){
//     console.log(i);
// }

/*function getNumbers (arr) {
    for (let i = 0; i < arr.length; i++) {
        console.log(arr[i]);
    }
}
const array = [1,2,3,4,5,6]
getNumbers(array);  */


// 2. Напишите цикл for, который выводит числа в консоль от 196 до 110 с шагом 3.
// for(let i = 196; i >= 110; i -= 3){
//     console.log(i);
// }

/*i++ 
i = i + 1
i = i + 3
i += 3 */


// 3. Напишите цикл for, который выводит в консоль нечетные числа от 45 до 35.
// for( let i = 45; i >= 35; i--){
//     if (i % 2 !== 0){
//         console.log(i)
//     }
// }


// 4. В программе заданы две переменные n и m с числовым значением каждая. 
// Напишите цикл, который считает сумму четных чисел и нечетных чисел от n до m. Суммы 
// выведите в консоль (в начале сумму четных чисел, а затем сумму нечетных).
// let n = 10;
// let m = 20;
// let sumEven = 0;
// let sumAdd = 0;

// for(let i = n; i <= m; i++){
//     if (i % 2 === 0){   
//         sumEven = sumEven + i
//     }else if (i % 2 != 0){
//         sumAdd = sumAdd + i
//     }
// }
// console.log(sumEven);
// console.log(sumAdd);


// 5. В программе задана переменная n. Напишите программу, которая с помощью цикла считает 
// сумму чисел от 1 до n и выводит в консоль.
// let n1 = 10;
// let sumN1 = 0;
// for (let i = 1; i < 10; i++){
//     sumN1 = sumN1 + i
// }
// console.log(sumN1);


